 ![png](Books_data/books.png)

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote
import os
from sqlalchemy.types import VARCHAR, CHAR, DECIMAL, DATE, DATETIME

In [2]:
username = "root"
password = "root"

connection = f"mysql+pymysql://{username}:{urlquote(password)}@localhost/books"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [4]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [5]:
q= '''SELECT * FROM authors'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [id, author_name]
Index: []

In [6]:
authors = pd.read_csv('books_data/authors.csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [7]:
books = pd.read_csv('books_data/books.csv')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [8]:
favorites = pd.read_csv('books_data/favorites.csv')
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [9]:
users = pd.read_csv('books_data/users.csv')
users.head(5)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [10]:
q = '''DESCRIBE authors;'''
describe_authors = pd.read_sql(q, connection)
describe_authors

         Field         Type Null  Key Default Extra
0           id          int   NO  PRI    None
1  author_name  varchar(45)  YES         None

In [11]:
q = '''DESCRIBE books;'''
describe_books = pd.read_sql(q, connection)
describe_books

       Field         Type Null  Key Default Extra
0         id          int   NO  PRI    None
1      title  varchar(45)  YES         None
2  author_id          int  YES         None

In [12]:
q = '''DESCRIBE favorites;'''
describe_favorites = pd.read_sql(q, connection)
describe_favorites

     Field Type Null Key Default Extra
0  book_id  int   NO        None
1  user_id  int   NO        None

In [13]:
q = '''DESCRIBE users;'''
describe_users = pd.read_sql(q, connection)
describe_users

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [14]:
# Changin the setting for FOREIGN_KEY_CHECKS with pd.read_sql
q = """SET @@FOREIGN_KEY_CHECKS=0"""
pd.read_sql(q,conn)

ResourceClosedError: This result object does not return rows. It has been closed automatically.

In [15]:
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, conn)

   @@FOREIGN_KEY_CHECKS
0                     0

In [16]:
authors.to_sql("author",connection,index=False, if_exists='append')

5

In [17]:
books.to_sql("books",connection,index=False, if_exists='append')

6

In [18]:
books.head(10)

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4
5   6          Frankenstein          5

In [19]:
favorites.to_sql("favorites",connection,index=False, if_exists='append')

7

In [20]:
users.to_sql("users",connection,index=False, if_exists='append')

3

In [21]:
# check the describe again to confirm no changes
q = """DESCRIBE books;"""
pd.read_sql(q,conn)

       Field         Type Null  Key Default Extra
0         id          int   NO  PRI    None
1      title  varchar(45)  YES         None
2  author_id          int  YES         None

In [22]:
q = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""
pd.read_sql(q,connection)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1

In [ ]:
# Closing the connection
conn.close()
# Deleting the engine and connection
del engine, conn